## Plan Result (prod_enterprise - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 52 to add, 14 to change, 87 to destroy.</code></pre>

* Create
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].time_rotating.rotation_period
  * module.subscription[&#34;CRIME-ADO-POC&#34;].time_rotating.rotation_period
  * module.subscription[&#34;DCD-RDO-Development&#34;].time_rotating.rotation_period
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].time_rotating.rotation_period
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].time_rotating.rotation_period
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].time_rotating.rotation_period
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].time_rotating.rotation_period
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;Security&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;Security&#34;]
* Update
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-RDO-Development&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_key_vault_secret.sp_token
* Delete
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_application.app
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_application_password.token
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_group_member.dts_operation_members
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_service_principal.sp
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].random_uuid.app_uuid
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].time_rotating.rotation_period
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_application.app
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_application_password.token
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group_member.dts_operation_members
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_service_principal.sp
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].random_uuid.app_uuid
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].time_rotating.rotation_period
* Replace
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_application_password.token
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-RDO-Development&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azuread_application_password.token
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azuread_application_password.token
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azuread_application_password.token




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["CP-COPILOT-BETA"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      + display_name        = (known after apply)
      ~ end_date            = "2026-08-19T07:07:40.398937Z" -> (known after apply)
      ~ id                  = "476d6e89-33bd-468d-a9e6-749f4a4aa7a1/password/03d36ee7-d20d-4d86-acab-e20e569c399b" -> (known after apply)
      ~ key_id              = "03d36ee7-d20d-4d86-acab-e20e569c399b" -> (known after apply)
      ~ rotate_when_changed = { # forces replacement
          - "rotation" = "2024-08-19T07:07:40Z"
        } -> (known after apply) # forces replacement
      ~ start_date          = "2024-08-19T07:07:40.398937Z" -> (known after apply)
      ~ value               = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["CP-COPILOT-BETA"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "9bcb07bd-5db2-460b-9bc7-bfb47ebeb5ff"
        # (10 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://c219653994d226d9eab74kv.vault.azure.net/secrets/sp-token/7426b8430425442980b83195da54f99b"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.subscription["CP-COPILOT-BETA"].time_rotating.rotation_period will be created
  + resource "time_rotating" "rotation_period" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 90
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.subscription["CRIME-ADO-POC"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      + display_name        = (known after apply)
      ~ end_date            = "2026-08-15T11:42:53.2478072Z" -> (known after apply)
      ~ id                  = "deb6a299-036c-4dd9-acb0-4cc63723e118/password/7efeb8ba-48dd-46ec-971f-a7fb76e3c889" -> (known after apply)
      ~ key_id              = "7efeb8ba-48dd-46ec-971f-a7fb76e3c889" -> (known after apply)
      ~ rotate_when_changed = { # forces replacement
          - "rotation" = "2024-08-15T11:42:53Z"
        } -> (known after apply) # forces replacement
      ~ start_date          = "2024-08-15T11:42:53.2478072Z" -> (known after apply)
      ~ value               = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["CRIME-ADO-POC"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "a0b9d7e8-87f0-48ba-b5ba-55c927cbcb4c"
        # (10 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://cef8dd15315775bcde240kv.vault.azure.net/secrets/sp-token/2fc9852db6b4408da35df54381f68457"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.subscription["CRIME-ADO-POC"].time_rotating.rotation_period will be created
  + resource "time_rotating" "rotation_period" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 90
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.subscription["DCD-RDO-Development"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      + display_name        = (known after apply)
      ~ end_date            = "2026-08-15T11:42:22.8656681Z" -> (known after apply)
      ~ id                  = "254e2a1e-dab8-4f57-9524-700c4611bbef/password/d6f957bb-79e8-4dc2-aee1-5acf51cad58e" -> (known after apply)
      ~ key_id              = "d6f957bb-79e8-4dc2-aee1-5acf51cad58e" -> (known after apply)
      ~ rotate_when_changed = { # forces replacement
          - "rotation" = "2024-08-15T11:42:22Z"
        } -> (known after apply) # forces replacement
      ~ start_date          = "2024-08-15T11:42:22.8656681Z" -> (known after apply)
      ~ value               = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DCD-RDO-Development"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "81af6f54-2313-41a7-8e43-dd18a137a3e4"
        # (10 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["DCD-RDO-Development"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://cfa397675bc7df0e51bf4kv.vault.azure.net/secrets/sp-token/af22710c32aa482c9a04ace163f282ab"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.subscription["DCD-RDO-Development"].time_rotating.rotation_period will be created
  + resource "time_rotating" "rotation_period" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 90
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.subscription["DCD-ROBOTICS-DEV"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      + display_name        = (known after apply)
      ~ end_date            = "2026-08-15T11:42:17.5784796Z" -> (known after apply)
      ~ id                  = "9b651012-bb82-4339-a83c-e8f1cd5f45f5/password/8268c6e2-03d0-4738-83d8-8dbed575b014" -> (known after apply)
      ~ key_id              = "8268c6e2-03d0-4738-83d8-8dbed575b014" -> (known after apply)
      ~ rotate_when_changed = { # forces replacement
          - "rotation" = "2024-08-15T11:42:17Z"
        } -> (known after apply) # forces replacement
      ~ start_date          = "2024-08-15T11:42:17.5784796Z" -> (known after apply)
      ~ value               = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DCD-ROBOTICS-DEV"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "c40cff36-4995-4d91-a36d-de15173dbad0"
        # (10 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["DCD-ROBOTICS-DEV"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://c6fe2c66c95ac3fb8966fkv.vault.azure.net/secrets/sp-token/4e2d1695bd404021960ce9fbe862d56e"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.subscription["DCD-ROBOTICS-DEV"].time_rotating.rotation_period will be created
  + resource "time_rotating" "rotation_period" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 90
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      + display_name        = (known after apply)
      ~ end_date            = "2026-08-15T11:42:17.6375796Z" -> (known after apply)
      ~ id                  = "10a46d0d-f32a-4252-9c52-65e3a829002a/password/950d223e-bd0c-4ad1-9a6f-612469ba84fc" -> (known after apply)
      ~ key_id              = "950d223e-bd0c-4ad1-9a6f-612469ba84fc" -> (known after apply)
      ~ rotate_when_changed = { # forces replacement
          - "rotation" = "2024-08-15T11:42:17Z"
        } -> (known after apply) # forces replacement
      ~ start_date          = "2024-08-15T11:42:17.6375796Z" -> (known after apply)
      ~ value               = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "c5a7b9ff-3821-42c8-ac61-247bc18a6cb0"
        # (10 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["DTS-ARCHIVING-TEST"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://ccad00eded34a1e94ef76kv.vault.azure.net/secrets/sp-token/2eb8c1ca03214dc4a0ed34104cb39f3a"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].time_rotating.rotation_period will be created
  + resource "time_rotating" "rotation_period" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 90
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Azure Kubernetes Service Cluster Admin Role"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids    = [] -> null
      - assignable_to_role         = false -> null
      - auto_subscribe_new_members = false -> null
      - behaviors                  = [] -> null
      - description                = "Grants aks cluster admin permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name               = "DTS AKS Administrators (sub:dts-management-sbox)" -> null
      - external_senders_allowed   = false -> null
      - hide_from_address_lists    = false -> null
      - hide_from_outlook_clients  = false -> null
      - id                         = "/groups/cf13cae2-da9c-4219-a5af-8ec197064a41" -> null
      - mail_enabled               = false -> null
      - mail_nickname              = "0e62ed21-25b6-46f3-bb13-1008a2a7c45b" -> null
      - members                    = [] -> null
      - object_id                  = "cf13cae2-da9c-4219-a5af-8ec197064a41" -> null
      - onpremises_sync_enabled    = false -> null
      - owners                     = [] -> null
      - prevent_duplicate_names    = true -> null
      - provisioning_options       = [] -> null
      - proxy_addresses            = [] -> null
      - security_enabled           = true -> null
      - types                      = [] -> null
      - writeback_enabled          = false -> null

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Azure Kubernetes Service Cluster User Role"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids    = [] -> null
      - assignable_to_role         = false -> null
      - auto_subscribe_new_members = false -> null
      - behaviors                  = [] -> null
      - description                = "Grants aks cluster user permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name               = "DTS AKS Users (sub:dts-management-sbox)" -> null
      - external_senders_allowed   = false -> null
      - hide_from_address_lists    = false -> null
      - hide_from_outlook_clients  = false -> null
      - id                         = "/groups/9390da56-b5ae-4aba-995a-c682f2e1d763" -> null
      - mail_enabled               = false -> null
      - mail_nickname              = "4ba2e462-dcaf-4821-9303-e65cb2d35ae6" -> null
      - members                    = [] -> null
      - object_id                  = "9390da56-b5ae-4aba-995a-c682f2e1d763" -> null
      - onpremises_sync_enabled    = false -> null
      - owners                     = [] -> null
      - prevent_duplicate_names    = true -> null
      - provisioning_options       = [] -> null
      - proxy_addresses            = [] -> null
      - security_enabled           = true -> null
      - types                      = [] -> null
      - writeback_enabled          = false -> null

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Contributor"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids    = [] -> null
      - assignable_to_role         = false -> null
      - auto_subscribe_new_members = false -> null
      - behaviors                  = [] -> null
      - description                = "Grants contributor permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name               = "DTS Contributors (sub:dts-management-sbox)" -> null
      - external_senders_allowed   = false -> null
      - hide_from_address_lists    = false -> null
      - hide_from_outlook_clients  = false -> null
      - id                         = "/groups/90ac3da9-9ae7-4849-8a49-e2fe903dd223" -> null
      - mail_enabled               = false -> null
      - mail_nickname              = "4c58b0d9-2f3c-4207-b69f-e9847a19b69f" -> null
      - members                    = [
          - "89f89bfe-3183-4d01-868c-29f7303580d9",
        ] -> null
      - object_id                  = "90ac3da9-9ae7-4849-8a49-e2fe903dd223" -> null
      - onpremises_sync_enabled    = false -> null
      - owners                     = [] -> null
      - prevent_duplicate_names    = true -> null
      - provisioning_options       = [] -> null
      - proxy_addresses            = [] -> null
      - security_enabled           = true -> null
      - types                      = [] -> null
      - writeback_enabled          = false -> null

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Key Vault Administrator"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids    = [] -> null
      - assignable_to_role         = false -> null
      - auto_subscribe_new_members = false -> null
      - behaviors                  = [] -> null
      - description                = "Grants key vault administrator permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name               = "DTS Key Vault Administrators (sub:dts-management-sbox)" -> null
      - external_senders_allowed   = false -> null
      - hide_from_address_lists    = false -> null
      - hide_from_outlook_clients  = false -> null
      - id                         = "/groups/ec9b048f-bd1f-4f23-b320-ef8259abd188" -> null
      - mail_enabled               = false -> null
      - mail_nickname              = "6a6c045c-b" -> null
      - members                    = [] -> null
      - object_id                  = "ec9b048f-bd1f-4f23-b320-ef8259abd188" -> null
      - onpremises_sync_enabled    = false -> null
      - owners                     = [
          - "0ec60e03-4262-44ce-abcf-83e2131c9207",
        ] -> null
      - prevent_duplicate_names    = true -> null
      - provisioning_options       = [] -> null
      - proxy_addresses            = [] -> null
      - security_enabled           = true -> null
      - types                      = [] -> null
      - writeback_enabled          = false -> null
    }

  # module.subscription["DTS-MANAGEMENT-SBOX"].azuread_group.groups["Owner"] will be destroyed
  # (because module.subscription["DTS-MANAGEMENT-SBOX"] is not in configuration)
  - resource "azuread_group" "groups" {
      - administrative_unit_ids    = [] -> null
      - assignable_to_role         = false -> null
      - auto_subscribe_new_members = false -> null
      - behaviors                  = [] -> null
      - description                = "Grants owner permissions to the DTS-MANAGEMENT-SBOX subscription" -> null
      - display_name               = "DTS Owners (sub:dts-management-sbox)" -> null
      - external_senders_allowed   = false -> null
      - hide_from_address_lists    = false -> null
      - hide_from_outlook_clients  = false -> null
      - id                         = "/groups/89f89bfe-3183-4d01-868c-29f7303580d9" -> null
      - mail_enabled               = false -> null
      - mail_nickname              = "2f447054-25e3-477e-a926-2e2e6478ee4b" -> null
      - members                    = [] -> null
      - object_id                  = "89f89bfe-3183-4d01-868c-29f7303580d9" -> null
      - onpremises_sync_enabled    = false -> null
      - owners                     = [] -> null
      - prevent_duplicate_names    = true -> null
      - provisioning_options       = [] -> null
      - proxy_addresses            = [] -> null
      - security_enabled           = true -> null
      - types                      = [] -> null
      - writeback_enabled 

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

  = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor["SDS-Prod"] will be created
  + resource "azuread_group" "storage_blob_data_contributor" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Storage Blob Data Contributor (mg:SDS-Prod)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor["SDS-Sandbox"] will be created
  + resource "azuread_group" "storage_blob_data_contributor" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Storage Blob Data Contributor (mg:SDS-Sandbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor["Security"] will be created
  + resource "azuread_group" "storage_blob_data_contributor" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Storage Blob Data Contributor (mg:Security)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["CFT"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["CFT-NonProd"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["CFT-Prod"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["CFT-Sandbox"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Crime"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Crime"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["HMCTS"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/HMCTS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Heritage"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Heritage-NonProd"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Heritage-Prod"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Heritage-Sandbox"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Platform"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Platform-NonProd"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Platform-Prod"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Platform-Sandbox"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["SDS"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["SDS-NonProd"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["SDS-Prod"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["SDS-Sandbox"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["Security"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Security"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 52 to add, 14 to change, 87 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.subscription["CP-COPILOT-BETA"].time_rotating.rotation_period has been deleted
  - resource "time_rotating" "rotation_period" {
      - id               = "2024-08-19T07:07:40Z" -> null
        # (10 unchanged attributes hidden)
    }

  # module.subscription["CRIME-ADO-POC"].time_rotating.rotation_period has been deleted
  - resource "time_rotating" "rotation_period" {
      - id               = "2024-08-15T11:42:53Z" -> null
        # (10 unchanged attributes hidden)
    }

  # module.subscription["DCD-RDO-Development"].time_rotating.rotation_period has been deleted
  - resource "time_rotating" "rotation_period" {
      - id               = "2024-08-15T11:42:22Z" -> null
        # (10 unchanged attributes hidden)
    }

  # module.subscription["DCD-ROBOTICS-DEV"].time_rotating.rotation_period has been deleted
  - resource "time_rotating" "rotation_period" {
      - id               = "2024-08-15T11:42:17Z" -> null
        # (10 unchanged attributes hidden)
    }

  # module.subscription["DTS-ARCHIVING-TEST"].time_rotating.rotation_period has been deleted
  - resource "time_rotating" "rotation_period" {
      - id               = "2024-08-15T11:42:17Z" -> null
        # (10 unchanged attributes hidden)
    }

  # module.subscription["MOJ DCD Atlassian NLE"].time_rotating.rotation_period has been deleted
  - resource "time_rotating" "rotation_period" {
      - id               = "2024-08-15T11:42:22Z" -> null
        # (10 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Non-Live Management"].time_rotating.rotation_period has been deleted
  - resource "time_rotating" "rotation_period" {
      - id               = "2024-08-15T11:42:53Z" -> null
        # (10 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":118,"Program":"tfcmt","SHA1":"","Target":"prod_enterprise - TerraformPlanApply","Vars":{}} -->